const map = {
    "isFile": false,
    "name": "objects",
    "entries": {
        "Моечное оборудывание": {
            "isFile": false,
            
            "name": "Моечное оборудывание",
            "entries": {
                "Конвеерная посудомоечная машина .png": {
                    "isFile": true,
                    
                    "name": "Конвеерная посудомоечная машина.png",
                    "base": "Конвеерная посудомоечная машина",
                    "ext": "png"
                },
                "Посудомоечные машины купольного и тонельного типа.png": {
                    "isFile": true,
                    
                    "name": "Посудомоечные машины купольного и тонельного типа.png",
                    "base": "Посудомоечные машины купольного и тонельного типа",
                    "ext": "png"
                }
            }
        },
        "Немеханическое оборудывание": {
            "isFile": false,
            
            "name": "Немеханическое оборудывание",
            "entries": {
                "Ванны моечные с рабочей поверхностью.png": {
                    "isFile": true,
                    
                    "name": "Ванны моечные с рабочей поверхностью.png",
                    "base": "Ванны моечные с рабочей поверхностью",
                    "ext": "png"
                },
                "Ванны моечные.png": {
                    "isFile": true,
                    
                    "name": "Ванны моечные.png",
                    "base": "Ванны моечные",
                    "ext": "png"
                },
                "Стелажи кухонные передвежные.png": {
                    "isFile": true,
                    
                    "name": "Стелажи кухонные передвежные.png",
                    "base": "Стелажи кухонные передвежные",
                    "ext": "png"
                },
                "Стелажи кухонные стационарные.png": {
                    "isFile": true,
                    
                    "name": "Стелажи кухонные стационарные.png",
                    "base": "Стелажи кухонные стационарные",
                    "ext": "png"
                },
                "Столы для сбора отходов.png": {
                    "isFile": true,
                    
                    "name": "Столы для сбора отходов.png",
                    "base": "Столы для сбора отходов",
                    "ext": "png"
                },
                "Столы производсьвенные.png": {
                    "isFile": true,
                    
                    "name": "Столы производсьвенные.png",
                    "base": "Столы производсьвенные",
                    "ext": "png"
                },
                "Тележки.png": {
                    "isFile": true,
                    
                    "name": "Тележки.png",
                    "base": "Тележки",
                    "ext": "png"
                }
            }
        },
        "Раздаточное обрудывание": {
            "isFile": false,
            
            "name": "Раздаточное обрудывание",
            "entries": {
                "Мармит электрический для горячих блюд.png": {
                    "isFile": true,
                    
                    "name": "Мармит электрический для горячих блюд.png",
                    "base": "Мармит электрический для горячих блюд",
                    "ext": "png"
                },
                "Мармит электрический для супов.png": {
                    "isFile": true,
                    
                    "name": "Мармит электрический для супов.png",
                    "base": "Мармит электрический для супов",
                    "ext": "png"
                },
                "Модуль кассовый универсльный.png": {
                    "isFile": true,
                    
                    "name": "Модуль кассовый универсльный.png",
                    "base": "Модуль кассовый универсльный",
                    "ext": "png"
                },
                "Прилавок нейтральный.png": {
                    "isFile": true,
                    
                    "name": "Прилавок нейтральный.png",
                    "base": "Прилавок нейтральный",
                    "ext": "png"
                },
                "Прилавок охлаждаемый.png": {
                    "isFile": true,
                    
                    "name": "Прилавок охлаждаемый.png",
                    "base": "Прилавок охлаждаемый",
                    "ext": "png"
                },
                "Стойка для подносов и столовых приборов.png": {
                    "isFile": true,
                    
                    "name": "Стойка для подносов и столовых приборов.png",
                    "base": "Стойка для подносов и столовых приборов",
                    "ext": "png"
                }
            }
        },
        "Тепловое оборудывание": {
            "isFile": false,
            
            "name": "Тепловое оборудывание",
            "entries": {
                "Жарочные и варочные поверхности": {
                    "isFile": false,
                    
                    "name": "Жарочные и варочные поверхности",
                    "entries": {
                        "Гриль электрический.png": {
                            "isFile": true,
                            
                            "name": "Гриль электрический.png",
                            "base": "Гриль электрический",
                            "ext": "png"
                        },
                        "Жарочная поверхность.png": {
                            "isFile": true,
                            
                            "name": "Жарочная поверхность.png",
                            "base": "Жарочная поверхность",
                            "ext": "png"
                        },
                        "Плита газовая.png": {
                            "isFile": true,
                            
                            "name": "Плита газовая.png",
                            "base": "Плита газовая",
                            "ext": "png"
                        },
                        "Плита электрическая.png": {
                            "isFile": true,
                            
                            "name": "Плита электрическая.png",
                            "base": "Плита электрическая",
                            "ext": "png"
                        }
                    }
                },
                "Конвекционные шкафы": {
                    "isFile": false,
                    
                    "name": "Конвекционные шкафы",
                    "entries": {
                        "Микроволновая печь.png": {
                            "isFile": true,
                            
                            "name": "Микроволновая печь.png",
                            "base": "Микроволновая печь",
                            "ext": "png"
                        },
                        "Пароконвектомат.png": {
                            "isFile": true,
                            
                            "name": "Пароконвектомат.png",
                            "base": "Пароконвектомат",
                            "ext": "png"
                        },
                        "Шкаф жарочный.png": {
                            "isFile": true,
                            
                            "name": "Шкаф жарочный.png",
                            "base": "Шкаф жарочный",
                            "ext": "png"
                        }
                    }
                },
                "Прочее": {
                    "isFile": false,
                    
                    "name": "Прочее",
                    "entries": {
                        "Котёл пищеварочный.png": {
                            "isFile": true,
                            
                            "name": "Котёл пищеварочный.png",
                            "base": "Котёл пищеварочный",
                            "ext": "png"
                        },
                        "Мармит.png": {
                            "isFile": true,
                            
                            "name": "Мармит.png",
                            "base": "Мармит",
                            "ext": "png"
                        },
                        "Тепловая витрина.png": {
                            "isFile": true,
                            
                            "name": "Тепловая витрина.png",
                            "base": "Тепловая витрина",
                            "ext": "png"
                        },
                        "Электрокипятильник.png": {
                            "isFile": true,
                            
                            "name": "Электрокипятильник.png",
                            "base": "Электрокипятильник",
                            "ext": "png"
                        }
                    }
                },
                "Фритюры": {
                    "isFile": false,
                    
                    "name": "Фритюры",
                    "entries": {
                        "Фритюрница.png": {
                            "isFile": true,
                            
                            "name": "Фритюрница.png",
                            "base": "Фритюрница",
                            "ext": "png"
                        }
                    }
                }
            }
        },
        "Упаковочное оборудывание": {
            "isFile": false,
            
            "name": "Упаковочное оборудывание",
            "entries": {
                "Машина вакуумной упаковки.png": {
                    "isFile": true,
                    
                    "name": "Машина вакуумной упаковки.png",
                    "base": "Машина вакуумной упаковки",
                    "ext": "png"
                },
                "Теромоупаковочные машины.png": {
                    "isFile": true,
                    
                    "name": "Теромоупаковочные машины.png",
                    "base": "Теромоупаковочные машины",
                    "ext": "png"
                },
                "Упаковочная машина.png": {
                    "isFile": true,
                    
                    "name": "Упаковочная машина.png",
                    "base": "Упаковочная машина",
                    "ext": "png"
                },
                "Упаковочный стол.png": {
                    "isFile": true,
                    
                    "name": "Упаковочный стол.png",
                    "base": "Упаковочный стол",
                    "ext": "png"
                }
            }
        },
        "Холодильное оборудывание": {
            "isFile": false,
            
            "name": "Холодильное оборудывание",
            "entries": {
                "Морозульные камеры": {
                    "isFile": false,
                    
                    "name": "Морозульные камеры",
                    "entries": {
                        "Морозильные лари.png": {
                            "isFile": true,
                            
                            "name": "Морозильные лари.png",
                            "base": "Морозильные лари",
                            "ext": "png"
                        },
                        "Охлаждаемые и морозальные шкафы.png": {
                            "isFile": true,
                            
                            "name": "Охлаждаемые и морозальные шкафы.png",
                            "base": "Охлаждаемые и морозальные шкафы",
                            "ext": "png"
                        },
                        "Холодильно-морозильные шкафы.png": {
                            "isFile": true,
                            
                            "name": "Холодильно-морозильные шкафы.png",
                            "base": "Холодильно-морозильные шкафы",
                            "ext": "png"
                        },
                        "Холодильные или морозильные шкафы.png": {
                            "isFile": true,
                            
                            "name": "Холодильные или морозильные шкафы.png",
                            "base": "Холодильные или морозильные шкафы",
                            "ext": "png"
                        },
                        "Холодильные или морозильыне камеры.png": {
                            "isFile": true,
                            
                            "name": "Холодильные или морозильыне камеры.png",
                            "base": "Холодильные или морозильыне камеры",
                            "ext": "png"
                        }
                    }
                },
                "Холодильные камеры": {
                    "isFile": false,
                    
                    "name": "Холодильные камеры",
                    "entries": {
                        "Охлаждаемые витрины.png": {
                            "isFile": true,
                            
                            "name": "Охлаждаемые витрины.png",
                            "base": "Охлаждаемые витрины",
                            "ext": "png"
                        },
                        "Охлаждаемые и морозальные шкафы.png": {
                            "isFile": true,
                            
                            "name": "Охлаждаемые и морозальные шкафы.png",
                            "base": "Охлаждаемые и морозальные шкафы",
                            "ext": "png"
                        },
                        "Холодильно-морозильные шкафы.png": {
                            "isFile": true,
                            
                            "name": "Холодильно-морозильные шкафы.png",
                            "base": "Холодильно-морозильные шкафы",
                            "ext": "png"
                        },
                        "Холодильные или морозильные шкафы.png": {
                            "isFile": true,
                            
                            "name": "Холодильные или морозильные шкафы.png",
                            "base": "Холодильные или морозильные шкафы",
                            "ext": "png"
                        },
                        "Холодильные или морозильыне камеры.png": {
                            "isFile": true,
                            
                            "name": "Холодильные или морозильыне камеры.png",
                            "base": "Холодильные или морозильыне камеры",
                            "ext": "png"
                        }
                    }
                }
            }
        },
        "механическое оборудывание": {
            "isFile": false,
            
            "name": "механическое оборудывание",
            "entries": {
                "Измельчители": {
                    "isFile": false,
                    
                    "name": "Измельчители",
                    "entries": {
                        "Блендер.png": {
                            "isFile": true,
                            
                            "name": "Блендер.png",
                            "base": "Блендер",
                            "ext": "png"
                        },
                        "Бликсер.png": {
                            "isFile": true,
                            
                            "name": "Бликсер.png",
                            "base": "Бликсер",
                            "ext": "png"
                        },
                        "Куттер.png": {
                            "isFile": true,
                            
                            "name": "Куттер.png",
                            "base": "Куттер",
                            "ext": "png"
                        },
                        "Миксер.png": {
                            "isFile": true,
                            
                            "name": "Миксер.png",
                            "base": "Миксер",
                            "ext": "png"
                        },
                        "Мясорубка.png": {
                            "isFile": true,
                            
                            "name": "Мясорубка.png",
                            "base": "Мясорубка",
                            "ext": "png"
                        },
                        "Овощерезка.png": {
                            "isFile": true,
                            
                            "name": "Овощерезка.png",
                            "base": "Овощерезка",
                            "ext": "png"
                        }
                    }
                },
                "Резательное оборудывание": {
                    "isFile": false,
                    
                    "name": "Резательное оборудывание",
                    "entries": {
                        "Ломтерезка.png": {
                            "isFile": true,
                            
                            "name": "Ломтерезка.png",
                            "base": "Ломтерезка",
                            "ext": "png"
                        },
                        "Пила для мяса.png": {
                            "isFile": true,
                            
                            "name": "Пила для мяса.png",
                            "base": "Пила для мяса",
                            "ext": "png"
                        },
                        "Слайсер.png": {
                            "isFile": true,
                            
                            "name": "Слайсер.png",
                            "base": "Слайсер",
                            "ext": "png"
                        },
                        "Хлеборезательняа машина.png": {
                            "isFile": true,
                            
                            "name": "Хлеборезательняа машина.png",
                            "base": "Хлеборезательняа машина",
                            "ext": "png"
                        }
                    }
                },
                "Формовочное оборудывание": {
                    "isFile": false,
                    
                    "name": "Формовочное оборудывание",
                    "entries": {
                        "Колбасный шприц.png": {
                            "isFile": true,
                            
                            "name": "Колбасный шприц.png",
                            "base": "Колбасный шприц",
                            "ext": "png"
                        }
                    }
                },
                "оборудывание для взвешивания": {
                    "isFile": false,
                    
                    "name": "оборудывание для взвешивания",
                    "entries": {
                        "Весы.png": {
                            "isFile": true,
                            
                            "name": "Весы.png",
                            "base": "Весы",
                            "ext": "png"
                        }
                    }
                },
                "перемешивающее оборудывание": {
                    "isFile": false,
                    
                    "name": "перемешивающее оборудывание",
                    "entries": {
                        "Ручной миксер.png": {
                            "isFile": true,
                            
                            "name": "Ручной миксер.png",
                            "base": "Ручной миксер",
                            "ext": "png"
                        },
                        "Тестомесильная машина.png": {
                            "isFile": true,
                            
                            "name": "Тестомесильная машина.png",
                            "base": "Тестомесильная машина",
                            "ext": "png"
                        }
                    }
                },
                "прочее": {
                    "isFile": false,
                    
                    "name": "прочее",
                    "entries": {
                        "Картофелечистка.png": {
                            "isFile": true,
                            
                            "name": "Картофелечистка.png",
                            "base": "Картофелечистка",
                            "ext": "png"
                        },
                        "Рыбоотчистительная машина.png": {
                            "isFile": true,
                            
                            "name": "Рыбоотчистительная машина.png",
                            "base": "Рыбоотчистительная машина",
                            "ext": "png"
                        },
                        "Соковыжималка.png": {
                            "isFile": true,
                            
                            "name": "Соковыжималка.png",
                            "base": "Соковыжималка",
                            "ext": "png"
                        },
                        "Универсальная кухонная машина (УКМ).png": {
                            "isFile": true,
                            
                            "name": "Универсальная кухонная машина (УКМ).png",
                            "base": "Универсальная кухонная машина (УКМ)",
                            "ext": "png"
                        }
                    }
                }
            }
        }
    }
}
export default map